/*

Task 1.4

Обчислити силу притягання F в науковому форматі між двома тілами, що мають, маси m1, m2 на відстані r.
Шукана сила визначається за формулою F = y * ((m1 * m2) / (r*r)), 
де y = 6.673 * 10^(-11) H*m^2/кг^2. Всі потрібні змінні присвоюються всередині програми. 
Результат вивести в окремому рядку вигляду <<F = ***>>, де замість зірок представлення в науковому вишляді.


*/

//#include <stdio.h>
//#include <math.h>
//#include <Windows.h>
//
//
//int main() {
//
//    SetConsoleCP(1251);
//    SetConsoleOutputCP(1251);
//
//	double m1, m2, r, F;
//	const double Y = 6.673E-11;
//
//    printf("Введіть масу першого тіла (кг): ");
//    scanf_s("%lf", &m1);
//
//    printf("Введіть масу другого тіла (кг): ");
//    scanf_s("%lf", &m2);
//
//    printf("Введіть відстань між тілами (м): ");
//    scanf_s("%lf", &r);
//
//    F = Y * (m1 * m2) / (r * r);
//
//    printf("F = %.2e\n", F);
//
//}
