/*

Homework 20.09.2024
Tasks 1.11 , 1.18

Task 1.11

Ініціалізувати два довільні рядки та вивести їх в одному рядку та поставивши між ними кому та пробіл,
а перед та після три окличних знаки. Приклад: !!! Hello , World! !!!


Task 1.18

Позиція у грі "Хрестики нулики" представлена в програмі за допомогою 9 символів виду " ", "0", "Х". Показати на екрані позицію у грі. 
Наприклад для позицій: {'0', 'x', ' ', ' ', 'x', '0', 'x', '0', ' '}

*/

#include <stdio.h>
#include <Windows.h>

void task1() {

	char str1[100], str2[100];

	printf("Введіть перший рядок: ");
	scanf_s("%99s", str1, sizeof(str1));

	printf("Введіть другий рядок: ");
	scanf_s("%99s", str2, sizeof(str2));

	printf("!!! %s , %s !!!\n", str1, str2);

}

void task2() {

	char str[10];  

	printf("Введіть 9 символів (O, X або пробіл): ");
	scanf_s("%9s", str, sizeof(str));  

	printf("%c | %c | %c\n", str[0], str[1], str[2]);
	printf("--|---|--\n");
	printf("%c | %c | %c\n", str[3], str[4], str[5]);
	printf("--|---|--\n");
	printf("%c | %c | %c\n", str[6], str[7], str[8]);
}

// Зіштовхнувся з такою проблемою, що коли я ввожу пробіл, то воно його зчитує, але вже всі наступні елементи не зчитує. 
// Я не знаю як зчитати масив з фігурними дужками та лапками.


int main() {

	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	
	//task2();

	//task1();
}

