/*

Task 1.6

Ввести дійсне число градусів Цельсія C (на екрані повинна бути підказка, що ввести) та обчислити й вивести число F в дійсному форматі
- та сама температура в градусах Фаренгейта за формулою F = 9*C / 5 + 32. 
Результат вивести в окремому рядку вигляду <<F = *** >>

*/

//#include <stdio.h>
//#include <Windows.h>
//
//
//int main() {
//
//    SetConsoleCP(1251);
//    SetConsoleOutputCP(1251);
//
//    double C;  
//    double F;  
//
//    printf("Введіть температуру в градусах Цельсія: ");
//    scanf_s("%lf", &C);
//
//    F = (9.0 / 5.0) * C + 32;
//
//    printf("Температура в градусах Фаренгейта: %.2lf\n", F);
//
//    return 0;
//}
