/* 

Classwork 13 - 09 - 2024. Tasks: 1.1-1.9

Task 1.1
Обчисліть натсупні математичні вирази та виведіть результати:
	2+31; 45*54-11; 15/4; 15.0/4; 67%5; (2*45.1 +3.2)/2;

*/ 

//#include <stdio.h>
//
//int main() {
//	printf("2 + 31 = %d\n", 2 + 31);
//	printf("45*54-11 = %d\n", 45 * 54 - 11);
//	printf("15 / 4 = %d\n", 15 / 4);
//	printf("15.0 / 4 = %.2f\n", 15.0 / 4);
//	printf("67 %% 5 = %d\n", 67 % 5);
//	printf("(2 * 45.1 + 3.2) / 2 = %.2f\n", (2 * 45.1 + 3.2) / 2);
//}